// 2. Задайте массив из 10 элементов, заполненный числами из
// промежутка [-10, 10]. Замените отрицательные элементы на
// положительные, а положительные на отрицательные.
int[] arr = new int[] { 1, 5, -5, 6, -9, 2, 5, 6, -7, 4 };
int i = 0;
while (i < arr.Length)
{
    arr[i] = arr[i] * -1;
    Console.WriteLine(arr[i]);
    i = i + 1;
}